{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [5, 5], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "batch_input_shape": [null, 50, 50, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_size": [5, 5], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "batch_input_shape": [null, 14, 14, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_size": [5, 5], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "batch_input_shape": [null, 5, 5, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "activation": "linear"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 84}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "units": 33}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}], "keras_version": "2.2.0", "backend": "tensorflow"}