{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_1", "batch_input_shape": [null, 50, 50, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dtype": "float32", "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 128, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 2, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "backend": "tensorflow"}