{"keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "padding": "valid", "strides": [1, 1], "batch_input_shape": [null, 50, 50, 1], "kernel_size": [3, 3], "filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 64, "padding": "valid", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 128, "use_bias": true, "bias_constraint": null, "activation": "relu", "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 33, "use_bias": true, "bias_constraint": null, "activation": "softmax", "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null}}], "class_name": "Sequential", "backend": "tensorflow"}