{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "batch_input_shape": [null, 50, 50, 1], "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "name": "conv2d_2", "use_bias": true, "bias_constraint": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "softmax", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 2, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2"}}], "backend": "tensorflow", "keras_version": "2.2.0"}